Ran Plan for 2 projects:

1. dir: `terraform/atlantis` workspace: `default`
1. dir: `terraform` workspace: `default`

### 1. dir: `terraform/atlantis` workspace: `default`
<details><summary>Show Output</summary>

```diff

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # helm_release.pritunl is tainted, so must be replaced
-/+ resource "helm_release" "pritunl" {
      ~ id                         = "pritunl" -> (known after apply)
      + manifest                   = (known after apply)
      ~ metadata                   = [
          - {
              - app_version = ""
              - chart       = "pritunl"
              - name        = "pritunl"
              - namespace   = "pritunl"
              - revision    = 1
              - values      = jsonencode(
                    {
                      - image          = {
                          - pullPolicy = "Always"
                          - registry   = "docker.pkg.github.com"
                          - repository = "autotune/pritunl-k8s-tf-do"
                          - tag        = "latest"
                        }
                      - livenessProbe  = {
                          - enabled             = true
                          - failureThreshold    = 6
                          - initialDelaySeconds = 30
                          - periodSeconds       = 10
                          - successThreshold    = 1
                          - timeoutSeconds      = 5
                        }
                      - mongoService   = "pritunl-mongodb"
                      - ports          = {
                          - http  = 80
                          - vpn   = 1194
                          - webui = 443
                        }
                      - privileged     = {
                          - enabled = true
                        }
                      - readinessProbe = {
                          - enabled             = true
                          - failureThreshold    = 6
                          - initialDelaySeconds = 5
                          - periodSeconds       = 10
                          - successThreshold    = 1
                          - timeoutSeconds      = 5
                        }
                      - replicaCount   = 3
                      - service        = {
                          - annotations = null
                          - type        = "ClusterIP"
                        }
                      - tty            = {
                          - enabled = true
                        }
                    }
                )
              - version     = "0.0.1"
            },
        ] -> (known after apply)
        name                       = "pritunl"
      ~ status                     = "failed" -> "deployed"
      ~ values                     = [
          - <<-EOT
                image:
                  registry: docker.pkg.github.com
                  repository: autotune/pritunl-k8s-tf-do
                  tag: latest
                  pullPolicy: Always
                
                # This should match whatever the 'mongodb' service is called in the cluster.
                # DNS should be able to resolve the service by this name for Pritunl to function.
                mongoService: "pritunl-mongodb"
                
                # Change these as you see fit.
                ports:
                  http: 80
                  vpn: 1194
                  webui: 443
                
                # This must be enabled when using Pritunl due to the rights that iptables will need in the Pritunl pods.
                privileged:
                  enabled: true
                
                # This will adjust the replicas that are deployed as a part of the Pritunl deployment.
                # This is '3' by default. Your Pritunl cluster number will be affected by this.
                replicaCount: 3
                
                # If 'type' here is 'LoadBalancer', these annotations are necessary to properly use an ELB if deploying this chart in AWS, so they'll automatically get used.
                # Be sure to add the appropriate domain name, cert ARN, and ssl-negotiation-policy (a default is used here).
                service:
                  annotations:
                  type: ClusterIP
                
                tty:
                  enabled: true
                
                # Health Checks
                livenessProbe:
                  enabled: true
                  initialDelaySeconds: 30
                  periodSeconds: 10
                  timeoutSeconds: 5
                  failureThreshold: 6
                  successThreshold: 1
                
                readinessProbe:
                  enabled: true
                  initialDelaySeconds: 5
                  periodSeconds: 10
                  timeoutSeconds: 5
                  failureThreshold: 6
                  successThreshold: 1
            EOT,
          + <<-EOT
                image:
                  registry: docker.pkg.github.com
                  repository: autotune/pritunl-k8s-tf-do
                  tag: latest
                  pullPolicy: Always
                  secret: ${ domain_name }-docker-tls
                
                # This should match whatever the 'mongodb' service is called in the cluster.
                # DNS should be able to resolve the service by this name for Pritunl to function.
                mongoService: "pritunl-mongodb"
                
                # Change these as you see fit.
                ports:
                  http: 80
                  vpn: 1194
                  webui: 443
                
                # This must be enabled when using Pritunl due to the rights that iptables will need in the Pritunl pods.
                privileged:
                  enabled: true
                
                # This will adjust the replicas that are deployed as a part of the Pritunl deployment.
                # This is '3' by default. Your Pritunl cluster number will be affected by this.
                replicaCount: 3
                
                # If 'type' here is 'LoadBalancer', these annotations are necessary to properly use an ELB if deploying this chart in AWS, so they'll automatically get used.
                # Be sure to add the appropriate domain name, cert ARN, and ssl-negotiation-policy (a default is used here).
                service:
                  annotations:
                  type: ClusterIP
                
                tty:
                  enabled: true
                
                # Health Checks
                livenessProbe:
                  enabled: true
                  initialDelaySeconds: 30
                  periodSeconds: 10
                  timeoutSeconds: 5
                  failureThreshold: 6
                  successThreshold: 1
                
                readinessProbe:
                  enabled: true
                  initialDelaySeconds: 5
                  periodSeconds: 10
                  timeoutSeconds: 5
                  failureThreshold: 6
                  successThreshold: 1
            EOT,
        ]
        # (24 unchanged attributes hidden)
    }

  # kubernetes_secret.docker_login_secret will be created
+ resource "kubernetes_secret" "docker_login_secret" {
      + data = (sensitive value)
      + id   = (known after apply)
      + type = "kubernetes.io/opaque"

      + metadata {
          + generation       = (known after apply)
          + name             = "wayofthesys-com-docker-login"
          + namespace        = "pritunl"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }
    }

Plan: 2 to add, 0 to change, 1 to destroy.

Warning: Version constraints inside provider configuration blocks are deprecated

  on providers.tf line 12, in provider "digitalocean":
  12:   version = ">=1.5.0"

Terraform 0.13 and earlier allowed provider version constraints inside the
provider configuration block, but that is now deprecated and will be removed
in a future version of Terraform. To silence this warning, move the provider
version constraint into the required_providers block.

```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -d terraform/atlantis`
* :put_litter_in_its_place: To **delete** this plan click [here](https://wayofthesys.com/lock?id=autotune%252Fpritunl-k8s-tf-do%252Fterraform%252Fatlantis%252Fdefault)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -d terraform/atlantis`
</details>
Plan: 2 to add, 0 to change, 1 to destroy.

---
### 2. dir: `terraform` workspace: `default`
**Plan Error**
<details><summary>Show Output</summary>

```
running "/usr/local/bin/terraform plan -input=false -refresh -no-color -out \"/root/.atlantis/repos/autotune/pritunl-k8s-tf-do/7/default/terraform/default.tfplan\"" in "/root/.atlantis/repos/autotune/pritunl-k8s-tf-do/7/default/terraform": exit status 1

Warning: Version constraints inside provider configuration blocks are deprecated

  on provider.tf line 12, in provider "digitalocean":
  12:   version = ">=1.5.0"

Terraform 0.13 and earlier allowed provider version constraints inside the
provider configuration block, but that is now deprecated and will be removed
in a future version of Terraform. To silence this warning, move the provider
version constraint into the required_providers block.

Error: No value for required variable

  on variables.tf line 72:
  72: variable "atlantis_github_user" {

The root module input variable "atlantis_github_user" is not set, and has no
default value. Use a -var or -var-file command line argument to provide a
value for this variable.

Error: No value for required variable

  on variables.tf line 76:
  76: variable "atlantis_github_user_token" {

The root module input variable "atlantis_github_user_token" is not set, and
has no default value. Use a -var or -var-file command line argument to
provide a value for this variable.

Error: No value for required variable

  on variables.tf line 80:
  80: variable "letsencrypt_email" {

The root module input variable "letsencrypt_email" is not set, and has no
default value. Use a -var or -var-file command line argument to provide a
value for this variable.

Error: No value for required variable

  on variables.tf line 101:
 101: variable "github_token" {

The root module input variable "github_token" is not set, and has no default
value. Use a -var or -var-file command line argument to provide a value for
this variable.

Error: No value for required variable

  on variables.tf line 105:
 105: variable "sslcom_keyid" {

The root module input variable "sslcom_keyid" is not set, and has no default
value. Use a -var or -var-file command line argument to provide a value for
this variable.

Error: No value for required variable

  on variables.tf line 109:
 109: variable "sslcom_hmac_key" {

The root module input variable "sslcom_hmac_key" is not set, and has no
default value. Use a -var or -var-file command line argument to provide a
value for this variable.

Error: No value for required variable

  on variables.tf line 113:
 113: variable "sslcom_private_hmac_key" {

The root module input variable "sslcom_private_hmac_key" is not set, and has
no default value. Use a -var or -var-file command line argument to provide a
value for this variable.

Error: No value for required variable

  on variables.tf line 125:
 125: variable "oauth_cookie_secret" {

The root module input variable "oauth_cookie_secret" is not set, and has no
default value. Use a -var or -var-file command line argument to provide a
value for this variable.

Error: No value for required variable

  on variables.tf line 129:
 129: variable "aws_access_key_id" {

The root module input variable "aws_access_key_id" is not set, and has no
default value. Use a -var or -var-file command line argument to provide a
value for this variable.

Error: No value for required variable

  on variables.tf line 133:
 133: variable "aws_secret_access_key" {

The root module input variable "aws_secret_access_key" is not set, and has no
default value. Use a -var or -var-file command line argument to provide a
value for this variable.

```
</details>

---
* :fast_forward: To **apply** all unapplied plans from this pull request, comment:
    * `atlantis apply`
* :put_litter_in_its_place: To delete all plans and locks for the PR, comment:
    * `atlantis unlock`
